#include <stdio.h>

#define N 8 /* разстояние между отделните позиции на табулатора */

/* Упражнение 1.20.  Напишете програма detab, която заменя табулациите
   от входа с подходящ брой шпации, така че да се заппази разстоянието
   до следващата позиция на табулатора.  Допуснете, че разполагате с
   фиксиран набор от позиции на табулатора, да кажем на всеки n. */

int tab2spaces(int pos);

main()
{
  int c; /* текущият символ */
  int pos; /* текуща позиция в изхода */

  pos = 0;
  while ((c = getchar()) != EOF) {
    if (c == '\n') {
      // реинициализираме състоянието си при нов ред
      pos = 0;
      putchar(c);
    }
    else if (c == '\t') {
      // трансформация на табулатора
      pos = pos + tab2spaces(pos);
    }
    else {
      ++pos;
      putchar(c);
    }
  }
  return 0;
}

/* tab2spaces: извежда необходимия брой шпации при срещнат табулатор
   на дадената позиция pos; връща броя им. */
int tab2spaces(int pos)
{
  int spaces;
  int i;

  spaces = N - (pos % N);
  for (i = 0; i < spaces; ++i)
    putchar(' ');
  return spaces;
}
