#include <stdio.h>

/* Упражнение 1.9. Копира входа си на изхода, като замества всеки
   табулатор с '\t', всяко връщане със символ назад с '\b' и всяка
   обратно наклонена черта с '\\'.  По този начин табулациите и
   връщането със символ назад стават видими по еидн недвусмислен
   начин. */

main()
{
  int c;

  while ((c = getchar()) != EOF) {
    if (c == '\t')
      printf("\\t");
    else
      if (c == '\b')
        printf("\\b");
      else
        if (c == '\\')
          printf("\\\\");
        else
          putchar(c);
  }

}
